In [ ]:
a=10
b=20
c=a+b
print(c)

In [12]:
import pandas as pd
num=[1,2,3,4,5]
x=[]
for i in num:
    x.append(i*i)


y=pd.DataFrame(x,num)
print(y)

    0
1   1
2   4
3   9
4  16
5  25

In [15]:
import pandas as pd

x=pd.DataFrame()
print(type(x))
x

<class 'pandas.core.frame.DataFrame'>

Empty DataFrame
Columns: []
Index: []

In [2]:
import pandas as pd
for i in range(1,11):
    print(i)

1
2
3
4
5
6
7
8
9
10

**step1**
- creating the dataframe
- we will create the data frame using the list
- and by using dictionary

In [4]:
import pandas as pd
df1=pd.DataFrame()
df1

Empty DataFrame
Columns: []
Index: []

In [5]:
type(df1)

pandas.core.frame.DataFrame

**step2**
- providing the data

In [9]:
names=[11,22,33,44,55]
m=pd.DataFrame(names)
m

    0
0  11
1  22
2  33
3  44
4  55

In [11]:
names=['manish','swetha','maha']
age=[20.12,20,1]
fam=zip(names,age)
df=pd.DataFrame(fam)
df

        0      1
0  manish  20.12
1  swetha  20.00
2    maha   1.00

In [13]:
names=['manish','swetha','maha']
age=[20.12,20,1]
gender=['male','female','female']
fam=zip(names,age,gender)

df=pd.DataFrame(fam)
df

        0      1       2
0  manish  20.12    male
1  swetha  20.00  female
2    maha   1.00  female

**step3**
- giving the column names

In [17]:
names=['baby','nani','nana','babu','barree','pandi']
p=pd.DataFrame(names,columns=['names'])
p

    names
0    baby
1    nani
2    nana
3    babu
4  barree
5   pandi

In [19]:
names=['swe','ee','rrr','yyy']
age=[11,22,33,44,55]
data=zip(names,age)
df=pd.DataFrame(data,columns=['name','age'])
df

  name  age
0  swe   11
1   ee   22
2  rrr   33
3  yyy   44

In [20]:
names=['swe','ee','rrr','yyy']
age=[11,22,33,44,55]
zip(names,age)
df=pd.DataFrame(zip(names,age),columns=['name','age'])
df

  name  age
0  swe   11
1   ee   22
2  rrr   33
3  yyy   44

**step4**
- **provide index**

In [25]:
l1=[1,2,3,4,5]
l2=[i*i for i in l1]
l3=[i*i*i for i in l1]
dd=zip(l1,l2,l3)
ind=[101,202,303,404,505]
col=['number','square','cube']
df=pd.DataFrame(dd,index=ind,columns=col)
df

     number  square  cube
101       1       1     1
202       2       4     8
303       3       9    27
404       4      16    64
505       5      25   125

**step5**
- 
- adding the column to the existing dataframe
- first we need to check how are there
- for the new column also we should give the same number of rows
- **syntax dataframe['column']=list of values equal to number of rows**
- salary=[111,2222,3333,444,5555]
- df['salary']=salary
-

In [27]:
import pandas as pd
df3=pd.DataFrame()
df3

Empty DataFrame
Columns: []
Index: []

In [30]:
names=['ss','dd','rr','tt']
age=[12,34,56,77,]
gen=['f','f','m','f']
ind=[11,22,33,44]
col=['names','age','gender']
df=pd.DataFrame(zip(names,age,gen),index=ind,columns=col)
df

   names  age gender
11    ss   12      f
22    dd   34      f
33    rr   56      m
44    tt   77      f

In [31]:
df['salary']=[1111,333,444,555555]
df

   names  age gender  salary
11    ss   12      f    1111
22    dd   34      f     333
33    rr   56      m     444
44    tt   77      f  555555